{
  "want": 120,
  "focus": 43,
  "academic": 0,
  "performance": 88,
  "improve": 63,
  "student": 111,
  "grades": 53,
  "achievement": 2,
  "priority": 94,
  "need": 80,
  "boost": 18,
  "gpa": 52,
  "classes": 23,
  "students": 112,
  "better": 16,
  "test": 117,
  "scores": 105,
  "help": 59,
  "perform": 87,
  "academically": 1,
  "outcomes": 82,
  "optimize": 81,
  "success": 113,
  "school": 104,
  "focusing": 44,
  "excellence": 38,
  "parents": 84,
  "concerned": 27,
  "wellbeing": 121,
  "mental": 78,
  "health": 58,
  "reduce": 99,
  "stress": 110,
  "anxious": 10,
  "emotional": 35,
  "important": 62,
  "support": 116,
  "experiencing": 40,
  "create": 29,
  "positive": 89,
  "environment": 37,
  "happiness": 56,
  "concern": 26,
  "bullying": 21,
  "problem": 95,
  "class": 22,
  "prevent": 92,
  "harassment": 57,
  "safer": 103,
  "classroom": 24,
  "excluded": 39,
  "prevention": 93,
  "address": 5,
  "aggressive": 6,
  "behavior": 15,
  "feel": 41,
  "unsafe": 118,
  "stop": 108,
  "anti": 9,
  "measures": 77,
  "report": 101,
  "feeling": 42,
  "intimidated": 70,
  "social": 107,
  "dynamics": 34,
  "issues": 72,
  "hierarchies": 60,
  "influence": 66,
  "manage": 76,
  "peer": 86,
  "pressure": 91,
  "interactions": 69,
  "balancing": 13,
  "cliques": 25,
  "forming": 46,
  "dominate": 32,
  "group": 54,
  "activities": 4,
  "balance": 12,
  "power": 90,
  "interaction": 68,
  "patterns": 85,
  "friends": 49,
  "strengthen": 109,
  "relationships": 100,
  "isolated": 71,
  "friend": 48,
  "groups": 55,
  "ensure": 36,
  "friendship": 50,
  "connections": 28,
  "improved": 64,
  "lack": 74,
  "make": 75,
  "bonds": 17,
  "kids": 73,
  "don": 33,
  "foster": 47,
  "friendships": 51,
  "recommend": 97,
  "improving": 65,
  "allocation": 7,
  "recommendations": 98,
  "based": 14,
  "model": 79,
  "outputs": 83,
  "assignments": 11,
  "suggestions": 115,
  "formation": 45,
  "insights": 67,
  "provide": 96,
  "data": 30,
  "analysis": 8,
  "results": 102,
  "actionable": 3,
  "does": 31,
  "suggest": 114,
  "bully": 20,
  "impact": 61,
  "bullies": 19,
  "separate": 106,
  "victims": 119
}